# chap5. Pandas

Pandas 의 주된 데이터 타입<br>
- Series<br>
- DataFrame

In [5]:
import pandas as pd
import numpy as np

import random

In [7]:
import os
os.path

In [11]:
data=[]
for i in range(4):
    data.append(random.randint(0,10))
    
obj=pd.Series(data)
type(obj)

pandas.core.series.Series

In [14]:
data

[1, 6, 5, 10]

In [15]:
# data 에 인덱스가 붙은것을 볼 수 있다.
obj

0     1
1     6
2     5
3    10
dtype: int64

index 색인 및 변경

In [16]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [17]:
obj.index=['a','b','c','d']

In [18]:
obj

a     1
b     6
c     5
d    10
dtype: int64

In [ ]:
#Dictionary 로 pd.series 만들기

In [21]:
dic=dict(zip(('a','b','c'),range(3)))
ds=pd.Series(dic)
ds

a    0
b    1
c    2
dtype: int64

In [22]:
# index로  행 추출

In [24]:
ds[['a','b']]

a    0
b    1
dtype: int64

In [25]:
ds['a':'b']

a    0
b    1
dtype: int64

In [26]:
ds['b':]

b    1
c    2
dtype: int64

연산규칙<br>
- 같은 인덱스끼리 연산

## DataFrame

In [31]:
lis=np.arange(15).reshape(3,5)
df=pd.DataFrame(lis)
df.columns=['c0','c1','c2','c3','c4']
df.index=['r0','r1','r2']
df

    c0  c1  c2  c3  c4
r0   0   1   2   3   4
r1   5   6   7   8   9
r2  10  11  12  13  14

In [38]:
# loc
# iloc 
# 스킵

In [ ]:
# 인덱스 및 열 이름 추가

In [36]:
df.index.name= '인덱스 이름'
df.columns.name= '열 이름'
df

열 이름    c0  c1  c2  c3  c4
인덱스 이름
r0       0   1   2   3   4
r1       5   6   7   8   9
r2      10  11  12  13  14

In [37]:
# 재색인 (행:axis=0, 열:axis=1 순서 바꾸기)

In [39]:
df.reindex([순서],axis=)
#변경하고 싶으면  df=df.reindex()

열 이름    c0  c1  c2  c3  c4
인덱스 이름
r0       0   1   2   3   4
r1       5   6   7   8   9
r2      10  11  12  13  14

행,열 삭제

In [41]:
'''
df.drop([])
#inplace 옵션
'''

'\ndf.drop([])\n#inplace 옵션\n'

In [43]:
drop=df.drop(['r0'])
drop

열 이름    c0  c1  c2  c3  c4
인덱스 이름
r1       5   6   7   8   9
r2      10  11  12  13  14

데이터 프레임간의 연산

In [44]:
'''
같은 행, 열 이름의 요소들끼리 연산
없는 경우는 NaN값
'''

'\n같은 행, 열 이름의 요소들끼리 연산\n없는 경우는 NaN값\n'

In [45]:
# 사용자가 만든 함수를 map으로 적용시키기

In [50]:
f= lambda x: '%.2f'%x
df.map(f) #데이터 프레임은 안됨

AttributeError: 'DataFrame' object has no attribute 'map'

In [51]:
type(df.loc['r1'])

pandas.core.series.Series

In [52]:
df.loc['r1'].map(f) # series 만 됨

열 이름
c0    5.00
c1    6.00
c2    7.00
c3    8.00
c4    9.00
Name: r1, dtype: object

정렬

In [ ]:
'''
data 값으로 정렬
 df.sort_values(by=,ascending=,inplace=)

index 값으로 정렬
 df.sort_index(axis=, ascending=, inplace=)
 
data ranking 정렬
 df.rank(method= 'first'_)
'''

중복 색인

In [ ]:
'''
df.index.is_unique
'''

In [59]:
arr= np.array([[i for i in range(5)],
             [3,6,2,3,5],
             [6,1,2,3,4],
             [9,3,5,7,8],
             [5,4,6,6,7]])
df3=pd.DataFrame(arr, index=['a','a','b','b','c'])
df3

   0  1  2  3  4
a  0  1  2  3  4
a  3  6  2  3  5
b  6  1  2  3  4
b  9  3  5  7  8
c  5  4  6  6  7

In [60]:
df3.index.is_unique

False

In [62]:
df3.loc['a']  # 'a'인 두줄 모두 출력

   0  1  2  3  4
a  0  1  2  3  4
a  3  6  2  3  5

In [64]:
df3.cumsum(axis=0)

    0   1   2   3   4
a   0   1   2   3   4
a   3   7   4   6   9
b   9   8   6   9  13
b  18  11  11  16  21
c  23  15  17  22  28

통계 및 데이터 프레임 요약 정보

In [ ]:
'''
df.describe()
df.info()

df.isnull().sum()  <- column 의 null 값의 수를 보고 싶은 경우
'''

In [65]:
df3

   0  1  2  3  4
a  0  1  2  3  4
a  3  6  2  3  5
b  6  1  2  3  4
b  9  3  5  7  8
c  5  4  6  6  7

In [66]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to c
Data columns (total 5 columns):
0    5 non-null int32
1    5 non-null int32
2    5 non-null int32
3    5 non-null int32
4    5 non-null int32
dtypes: int32(5)
memory usage: 300.0+ bytes

In [67]:
df3.describe()

              0        1         2         3        4
count  5.000000  5.00000  5.000000  5.000000  5.00000
mean   4.600000  3.00000  3.400000  4.400000  5.60000
std    3.361547  2.12132  1.949359  1.949359  1.81659
min    0.000000  1.00000  2.000000  3.000000  4.00000
25%    3.000000  1.00000  2.000000  3.000000  4.00000
50%    5.000000  3.00000  2.000000  3.000000  5.00000
75%    6.000000  4.00000  5.000000  6.000000  7.00000
max    9.000000  6.00000  6.000000  7.000000  8.00000

## correlation

In [ ]:
'''
pd.corr()
'''

In [72]:
df3

   0  1  2  3  4
a  0  1  2  3  4
a  3  6  2  3  5
b  6  1  2  3  4
b  9  3  5  7  8
c  5  4  6  6  7

In [73]:
df3.corr()

          0         1         2         3         4
0  1.000000  0.070117  0.564639  0.717244  0.704161
1  0.070117  1.000000  0.241825  0.181369  0.389249
2  0.564639  0.241825  1.000000  0.934211  0.903652
3  0.717244  0.181369  0.934211  1.000000  0.974250
4  0.704161  0.389249  0.903652  0.974250  1.000000

In [74]:
df3.T.corr()

          a         a         b         b         c
a  1.000000  0.096225 -0.164399  0.131306  0.832050
a  0.096225  1.000000 -0.300567 -0.353779 -0.320256
b -0.164399 -0.300567  1.000000  0.949812  0.273576
b  0.131306 -0.353779  0.949812  1.000000  0.528059
c  0.832050 -0.320256  0.273576  0.528059  1.000000

### NaN값 처리하기

In [ ]:
'''
dropna(axis='',how='',thresh='',subset=[])
    how= any 와 all 이 있다.
    thresh 는 해당 갯수 이상 있으면 지움
    subset은 해당 열만 찾아본다.
    
filna(value) : 모든 NaN값을 value로 채워준다.
fillna({'해당 열': 대체값,'해당 열':대체값},axis)
'''

In [ ]:
df.fillna()
df.dropna()

 ## 계층적 색인

row나 column에 색인이 여러겹으로 들어가는 것<br>
계층적 색인 함수<br>
<br>
  stack() : 계층적 색인으로 만들어준다.<br>
  unstack() : stack()의 반대

In [86]:
data = Series(np.random.rand(10),
              # index(row)의 색인을 두겨브로 하였다.
              index=[['a','a','a','b','b','b','c','c','d','d'],
                    [1,2,3,1,2,3,1,2,2,3]])
data.index.names =['type1','type2']

In [87]:
data

type1  type2
a      1        0.935674
       2        0.931515
       3        0.656214
b      1        0.416717
       2        0.414891
       3        0.329121
c      1        0.370608
       2        0.469929
d      2        0.844227
       3        0.219583
dtype: float64

In [90]:
#계층적 색인중 원하는 색인을 columns으로 만들어 2차원으로 만든다
data.unstack(level=0)

type1         a         b         c         d
type2
1      0.935674  0.416717  0.370608       NaN
2      0.931515  0.414891  0.469929  0.844227
3      0.656214  0.329121       NaN  0.219583

In [91]:
data.unstack(level=1)

type2         1         2         3
type1
a      0.935674  0.931515  0.656214
b      0.416717  0.414891  0.329121
c      0.370608  0.469929       NaN
d           NaN  0.844227  0.219583

In [92]:
#이름도 가능
data.unstack('type1')

type1         a         b         c         d
type2
1      0.935674  0.416717  0.370608       NaN
2      0.931515  0.414891  0.469929  0.844227
3      0.656214  0.329121       NaN  0.219583

In [96]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           names=['type1', 'type2'])

In [97]:
data['b':'c']

type1  type2
b      1        0.416717
       2        0.414891
       3        0.329121
c      1        0.370608
       2        0.469929
dtype: float64

In [107]:
data[:][5]

0.3291209944009339